sedfoam-master/tutorials/RAS/2DScour/1D/Allrun
#!/bin/sh

# Create the mesh
blockMesh

# create the intial time folder
cp -r 0_org 0

# Run sedFoam
sedFoam_rbgh > log&


